In [2]:
import pandas as pd
import numpy as np

s = pd.Series([1,3,4, np.nan, 4, 55])
print(s)

0     1.0
1     3.0
2     4.0
3     NaN
4     4.0
5    55.0
dtype: float64

In [3]:
dates = pd.date_range('20180101', periods=6)
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['a','b','c','d'])
df

                   a         b         c         d
2018-01-01 -0.334050  1.736229 -0.525360 -0.606951
2018-01-02  0.940247 -0.975722 -0.816620 -1.094597
2018-01-03  1.067849  0.704857 -0.284190  1.016822
2018-01-04 -0.455764  0.073466  0.121414  0.786785
2018-01-05 -0.116343 -0.117783  0.061312 -0.767024
2018-01-06  0.330670  1.261933  0.961566 -0.901172

In [8]:
df_1 = pd.DataFrame(np.arange(12).reshape(3,4))
df_1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [13]:
df_2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20180101'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'foo'})
df_2

     A          B    C  D      E    F
0  1.0 2018-01-01  1.0  3   test  foo
1  1.0 2018-01-01  1.0  3  train  foo
2  1.0 2018-01-01  1.0  3   test  foo
3  1.0 2018-01-01  1.0  3  train  foo

In [15]:
df_2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df_2.index    # row index

Int64Index([0, 1, 2, 3], dtype='int64')

In [17]:
df_2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [18]:
df_2.values

array([[1.0, Timestamp('2018-01-01 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2018-01-01 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2018-01-01 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2018-01-01 00:00:00'), 1.0, 3, 'train', 'foo']], dtype=object)

In [19]:
df_2.describe()    # 只計算可以計算的元素行

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [20]:
df_2.T    # 轉至矩陣

,0,1,2,3
A,1,1,1,1
B,2018-01-01 00:00:00,2018-01-01 00:00:00,2018-01-01 00:00:00,2018-01-01 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [21]:
df_2.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2018-01-01  1.0
1  foo  train  3  1.0 2018-01-01  1.0
2  foo   test  3  1.0 2018-01-01  1.0
3  foo  train  3  1.0 2018-01-01  1.0

In [22]:
df_2.sort_index(axis=0, ascending=False)

     A          B    C  D      E    F
3  1.0 2018-01-01  1.0  3  train  foo
2  1.0 2018-01-01  1.0  3   test  foo
1  1.0 2018-01-01  1.0  3  train  foo
0  1.0 2018-01-01  1.0  3   test  foo

In [23]:
df_2.sort_values(by='E')

     A          B    C  D      E    F
0  1.0 2018-01-01  1.0  3   test  foo
2  1.0 2018-01-01  1.0  3   test  foo
1  1.0 2018-01-01  1.0  3  train  foo
3  1.0 2018-01-01  1.0  3  train  foo